/****************************************************************/
/*	プロジェクト名:												*/
/*	ファイル名：												*/
/*	内容：														*/
/*	日付：														*/
/*	コンパイラ:													*/
/*	note:														*/
/*	作成者：													*/
/****************************************************************/
#include "Help.h"
#include"Main_Title.h"

//-----------------------------------
// コンストラクタ
// 宣言したメンバ変数を初期化する場所
//-----------------------------------
Help::Help()
{
    //画像
    help_image = LoadGraph("../imege/help.png");
}

//-----------------------------------
// 更新処理
//-----------------------------------
AbstractScene* Help::Update()
{
    //Aボタンが押されたらタイトル移動
    if(PadInput::OnButton(XINPUT_BUTTON_A))
    {
        return new Main_Title();
    }

    return this;
}

//-----------------------------------
// 描画以外
//-----------------------------------
void Help::Draw() const
{
    //文字大きさ変更
    SetFontSize(40);

    
    DrawGraph(0, 0, help_image, FALSE);

}
